package com.kku.pharm.project.dmathere.data

import com.kku.pharm.project.dmathere.R
import com.kku.pharm.project.dmathere.data.model.Medicine

object Constant {
    const val PERMISSIONS_REQUEST_CODE = 1

    const val TIME_DESC_MORNING = "MORNING"
    const val TIME_DESC_AFTERNOON = "AFTERNOON"
    const val TIME_DESC_EVENING = "EVENING"
    const val TIME_DESC_NIGHT = "NIGHT"

    const val STATUS_INACTIVE = "INACTIVE"
    const val STATUS_ACTIVE = "ACTIVE"

    val medicineNameList = arrayOf(
            "NovoRapid® Penfill®",
            "Insulatard® Penfill®",
            "Actrapid® Penfill®",
            "Mixtard® 30 Penfill®",
            "NovoMix® 30 Penfill®",
            "Lantus® Solostar®",
            "Levemir® Flexpen",
            "Mixtard® 30 HM",
            "Actrapid® HM",
            "Insulatard® HM"
    )

    val medicineDataList = arrayListOf(
            Medicine(
                    "NovoRapid® Penfill®",
                    "อินซูลินชนิดออกฤทธิ์เร็ว",
                    "รักษาโรคเบาหวาน",
                    "เก็บไว้ในตู้เย็น (อุณหภูมิ 2-8 องศาเซลเซียส) ห้ามเก็บไว้ในช่องแช่แข็ง หลีกเลี่ยงความร้อนและแสงแดด",
                    "ใช้งานภายใน 28 วัน เมื่อเก็บในอุณหภูมิต่ำกว่า 30 องศาเซลเซียส ไม่ต้องเก็บไว้ในตู้เย็น",
                    true
            ),
            Medicine(
                    "Insulatard® Penfill®",
                    "อินซูลินชนิดออกฤทธิ์ปานกลาง",
                    "รักษาโรคเบาหวาน",
                    "เก็บไว้ในตู้เย็น (อุณหภูมิ 2-8 องศาเซลเซียส) ห้ามเก็บไว้ในช่องแช่แข็ง หลีกเลี่ยงความร้อนและแสงแดด",
                    "ใช้งานภายใน 28 วัน เมื่อเก็บในอุณหภูมิต่ำกว่า 30 องศาเซลเซียส ไม่ต้องเก็บไว้ในตู้เย็น",
                    true
            ),
            Medicine(
                    "Actrapid® Penfill®",
                    "อินซูลินชนิดออกฤทธิ์สั้น",
                    "รักษาโรคเบาหวาน",
                    "เก็บไว้ในตู้เย็น (อุณหภูมิ 2-8 องศาเซลเซียส) ห้ามเก็บไว้ในช่องแช่แข็ง หลีกเลี่ยงความร้อนและแสงแดด",
                    "ใช้งานภายใน 28 วัน เมื่อเก็บในอุณหภูมิต่ำกว่า 30 องศาเซลเซียส ไม่ต้องเก็บไว้ในตู้เย็น",
                    true
            ),
            Medicine(
                    "Mixtard® 30 Penfill®",
                    "อินซูลินชนิดผสมที่ออกฤทธิ์รวดเร็วและยาวนาน",
                    "รักษาโรคเบาหวาน",
                    "เก็บไว้ในตู้เย็น (อุณหภูมิ 2-8 องศาเซลเซียส) ห้ามเก็บไว้ในช่องแช่แข็ง หลีกเลี่ยงความร้อนและแสงแดด",
                    "ใช้งานภายใน 28 วัน เมื่อเก็บในอุณหภูมิต่ำกว่า 30 องศาเซลเซียส ไม่ต้องเก็บไว้ในตู้เย็น",
                    true
            ),
            Medicine(
                    "NovoMix® 30 Penfill®",
                    "อินซูลินชนิดผสมที่ออกฤทธิ์รวดเร็วและยาวนาน",
                    "รักษาโรคเบาหวาน",
                    "เก็บไว้ในตู้เย็น (อุณหภูมิ 2-8 องศาเซลเซียส) ห้ามเก็บไว้ในช่องแช่แข็ง หลีกเลี่ยงความร้อนและแสงแดด",
                    "ใช้งานภายใน 28 วัน เมื่อเก็บในอุณหภูมิต่ำกว่า 30 องศาเซลเซียส ไม่ต้องเก็บไว้ในตู้เย็น",
                    true
            ),
            Medicine(
                    "Lantus® Solostar®",
                    "อินซูลินชนิดออกฤทธิ์ยาว",
                    "รักษาโรคเบาหวาน",
                    "เก็บไว้ในตู้เย็น (อุณหภูมิ 2-8 องศาเซลเซียส) ห้ามเก็บไว้ในช่องแช่แข็ง หลีกเลี่ยงความร้อนและแสงแดด",
                    "ใช้งานภายใน 28 วัน เมื่อเก็บในอุณหภูมิต่ำกว่า 30 องศาเซลเซียส ไม่ต้องเก็บไว้ในตู้เย็น",
                    true
            ),
            Medicine(
                    "Levemir® Flexpen",
                    "อินซูลินชนิดออกฤทธิ์ยาว",
                    "รักษาโรคเบาหวาน",
                    "เก็บไว้ในตู้เย็น (อุณหภูมิ 2-8 องศาเซลเซียส) ห้ามเก็บไว้ในช่องแช่แข็ง หลีกเลี่ยงความร้อนและแสงแดด",
                    "ใช้งานภายใน 28 วัน เมื่อเก็บในอุณหภูมิต่ำกว่า 30 องศาเซลเซียส ไม่ต้องเก็บไว้ในตู้เย็น",
                    true
            ),
            Medicine(
                    "Mixtard® 30 HM",
                    "อินซูลินชนิดผสมที่ออกฤทธิ์รวดเร็วและยาวนาน",
                    "รักษาโรคเบาหวาน",
                    "เก็บไว้ในตู้เย็น (อุณหภูมิ 2-8 องศาเซลเซียส) ห้ามเก็บไว้ในช่องแช่แข็ง หลีกเลี่ยงความร้อนและแสงแดด",
                    "ใช้งานภายใน 28 วัน เมื่อเก็บในตู้เย็น",
                    false
            ),
            Medicine(
                    "Actrapid® HM",
                    "อินซูลินชนิดออกฤทธิ์สั้น",
                    "รักษาโรคเบาหวาน",
                    "เก็บไว้ในตู้เย็น (อุณหภูมิ 2-8 องศาเซลเซียส) ห้ามเก็บไว้ในช่องแช่แข็ง หลีกเลี่ยงความร้อนและแสงแดด",
                    "ใช้งานภายใน 28 วัน เมื่อเก็บในตู้เย็น",
                    false
            ),
            Medicine(
                    "Insulatard® HM",
                    "อินซูลินชนิดออกฤทธิ์ปานกลาง",
                    "รักษาโรคเบาหวาน",
                    "เก็บไว้ในตู้เย็น (อุณหภูมิ 2-8 องศาเซลเซียส) ห้ามเก็บไว้ในช่องแช่แข็ง หลีกเลี่ยงความร้อนและแสงแดด",
                    "ใช้งานภายใน 28 วัน เมื่อเก็บในตู้เย็น",
                    false
            )
    )

    var imgArray = intArrayOf(
            R.drawable.img_med_1,
            R.drawable.img_med_3,
            R.drawable.img_med_9,
            R.drawable.img_med_2,
            R.drawable.img_med_10,
            R.drawable.img_med_7,
            R.drawable.img_med_6,
            R.drawable.img_med_4,
            R.drawable.img_med_8,
            R.drawable.img_med_5)

}